test/icoJuliaParcelFoam/cavity3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoJuliaParcelFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Short test run
endTime         0.5;

deltaT          0.01;

writeControl    timeStep;

// One write at the last step to exercise the coupled VTK write hooks
writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   3;

runTimeModifiable yes;

// ************************************************************************* //
